app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE (animal_type ILIKE '%bird%')
SELECT "pets".* FROM "pets" WHERE "pets"."animal_type" = $1  [["animal_type", 0]]
---
  def search
    @pets = Pet.all
    @pets = @pets.where(animal_type: Pet.animal_types[params[:animal_type]]) if params[:animal_type].present?

SELECT "pets".* FROM "pets"
---
  def index
    @pet = Pet.all